Repository: Enes-Altuntas/PaPaPe
Catalog: lib/l10n/app_*.arb
Languages: tr

# mapLegendActive
source: Active
tr: Aktif

# mapLegendWaiting
source: Waiting
tr: Beklemede

# mapLegendInactive
source: Inactive
tr: İnaktif

source: Business name
tr: İşletme ismi

# createDate
source: Creation Date/Time
tr: Oluşturulma Tarihi/Saati

# conatactNum
source: Contact Number
tr: İletişim No

# showBusinessProfile
source: see campaigns...
tr: kampanyaları gör...

source: Please wait !
tr: Lütfen bekleyiniz !

# welcomeWithName
source: Welcome {}
tr: Hoşgeldiniz {}

source: Welcome
tr: Hoşgeldiniz

source: Search Filters
tr: Arama Filtreleri

source: Favorite Businesses
tr: Favori İşletmeler

# myCampaignCodes
source: Campaign Codes
tr: Kampanya Kodları

# myReservations
source: Bookings
tr: Reservasyonlar

# myWishes
source: Wishes and Suggestions
tr: Dilek & Şikayetler

# kvkk
source: KVKK and Privacy
tr: KVKK ve Gizlilik

# logout
source: Sign out
tr: Çıkış Yap

# profile
source: Profile Options
tr: Profil Seçenekleri

# wannaQuit
source: Are you sure you want to exit?
tr: Çıkış yapmak istediğinizden emin misiniz ?

source: Yes
tr: Evet

source: No
tr: Hayır

source: Done
tr: Bitir

# introduction_title_1
source: Welcome to MyRest!
tr: MyRest'e hoş geldiniz!

# introduction_description_1
source: With MyRest, you can benefit from the campaigns of the businesses closest to you, made by the business in certain times, access the current menu of the business at any time, make a reservation, and send your wishes and suggestions directly to the business manager.
tr: MyRest ile size en yakın işletmelerin, işletme tarafından belli saat dilimlerinde yapılmış kampanyalarıdan faydalanabilir , işletmenin güncel menüsüne her an ulaşabilir , rezervasyon yaptırabilir , dilek ve önerilerinizi direk olarak işletme müdürüne iletebilirsiniz.

# introduction_title_2
source: Determine your activity
tr: Aktivitenizi Belirleyin

# introduction_description_2
source: Now all you have to do when going out is to determine your outdoor eating and drinking activity. MyRest will allow you to see the most affordable menus and offers.
tr: Artık dışarı çıkarken yapmanız gereken tek şey, dışarıdaki yeme-içme aktivitenizi belirlemek. MyRest en uygun fiyatlı menü ve kampayaları görmenizi sağlayacaktır.

# introduction_title_3
source: Campaign Statuses
tr: Kampanya Durumları

# introduction_description_3
source: The green color indicates that the business's campaign is currently active. Yellow indicates that the business currently has a campaign, but is not yet active, and will be active in the future. Gray color indicates that the business does not have a current campaign, but may have one in the coming days or hours.
tr: Yeşil renk, işletmenin şu anda kampanyasının aktif olduğunu. Sarı Renk, işletmenin şu anda kampanyasının olduğunu fakat henüz aktif olmadığını ileriki saatlerde aktif olacağını gösterir. Gri renk, işletmenin mevcut bir kampanyası olmadığını gösterir fakat ileriki günlerde veya saatlerde bir kampanyası olabilir.

# introduction_title_4
source: Teamwork
tr: Ekip Çalışması

# introduction_description_4
source: The MyRest team takes an active role in the field to bring you to various businesses and establishes collaborations with businesses with all its teams. If you are a business owner and want to make a transition to the digital world with MyRest, you can visit our website and fill out the business form.
tr: MyRest ekibi sizleri çeşitli işletmelere ulaştırmak için saha da aktif olarak görev alıp, tüm ekipleri ile işletmeler ile işbirlikleri kurmaktadır. Sizlerde eğer işletme sahibiyseniz ve MyRest ile dijital dünyaya bir geçiş yapmak istiyorsanız web sitemizi ziyaret edebilir, işletme formunu doldurabilirsiniz.

# introduction_title_5
source: Thank You
tr: Teşekkürler

# introduction_description_5
source: Thank you for being with us.You can reach us by filling out the support form on our website or you can reach us by WhatsApp support line on any problems.
tr: Sizlere, bizimle birlikte olduğunuz için teşekkür ederiz. Herhangi bir probleminizde WhatsApp destek hattımıza veya websitemiz üzerinden destek formunu doldurarak bizlere ulaşabiilirsiniz.

# filters
source: Search Filters
tr: Arama Seçenekleri

# onlyActive
source: Only Active Campaigns
tr: Sadece Aktif Kampanyalar

# distance
source: Search Distance
tr: Arama Uzaklığı

# previewOptions
source: Graphic Options
tr: Görüntü Seçenekleri

source: Night Mode
tr: Gece Modu

# nameQuestion
source: Hello! First of all, can we get your name?
tr: Merhaba! Öncelikle isminizi öğrenebilir miyiz?

# continueWord
source: Continue
tr: Devam Et

# name
source: Name - Surname
tr: İsim - Soyisim

# cantBeNull
source: * Can't be empty!
tr: * Boş bırakılamaz!

# onlyNumbers
source: * Numbers only!
tr: * Sadece rakam!

# onlyLetter
source: * Letters only!
tr: * Sadece harf!

# containLetter
source: * Must contain letter!
tr: * Harf içermelidir!

# resDescHint
source: * You must enter the specific information that the business needs to know about your booking in this field.
tr: * Rezervasyonunuz ile ilgili işletmenin bilmesi gereken spesifik bilgileri bu alana girmelisiniz.

# resCountHint
source: * The number of people allows the business to know how many people the booking will be made on behalf of.
tr: * Kişi sayısı, işletmenin, rezervasyonun kaç kişi adına yapılacağını bilmesine olanak sağlar.

# resNameHint
source: * The Name and surname field is used to convey the name and surname on which the reservation will be made.
tr: * İsim soyisim alanı, rezervasyonun hangi isim ve soyisim üzerine yapılacağını iletmek içindir.

# resTelHint
source: * The booking phone is to let the business know at what number to reach you in an important situation.
tr: * Rezervasyon telefonu, işletmenin önemli bir durumda size hangi numaradan ulaşacağını bilmesini sağlamak içindir.

# resDateHint
source: * The Booking date tells you what date and time your reservation is for
tr: * Rezervasyon tarihi, rezervasyonunuz hangi tarih ve saat için olduğunu anlatır

source: No Campaign Picture
tr: Kampanya Resmi Yok

# resStatus
source: Booking Status
tr: Başvuru Durumu

# resPhoneBook
source: Booking Phone
tr: Rezervasyon Telefonu

source: Approved
tr: Onaylandı

source: Waiting
tr: Beklemede

source: Rejected
tr: Reddedildi

source: Canceled
tr: İptal Edilmiş

source: Campaign Start
tr: Kampanya Başlangıç

source: Campaign Finish
tr: Kampanya Bitiş

# takeCampaignCode
source: Get Campaign Code
tr: Kampanya Kodu Al

source: Call Business
tr: İşletmeyi Ara

source: Find Business
tr: İşletmeyi Bul

# makeReservation
source: Make Booking
tr: Rezervasyon Yaptır

# resCount
source: Number of People
tr: Kişi Sayısı

# resDesc
source: Booking Description
tr: Rez. Tanımı

# resPhone
source: Phone
tr: Tel

# resDate
source: Booking Date
tr: Rez. Tarihi

# sendWishes
source: Send Wishes & Suggestions
tr: Dilek & Şikayet Gönder

source: Unknown
tr: Belirtilmemiş

# congrats
source: Congratulations!
tr: Tebrikler!

source: Warning
tr: Dikkat

source: Error
tr: Hata

source: Info
tr: Bilgilendirme

source: Back
tr: Geri

# wishTitle
source: Wish & Suggestions Title
tr: Dilek & Şikayet Başlığı

# wishDesc
source: Wish & Suggestions Description
tr: Dilek & Şikayet Açıklaması

# wishDescHint
source: It is very important for the business that you write the Wish & Suggestions statement as clearly and precisely as you can.
tr: * Dilek & Şikayet açıklamasını elinizden geldiği kadar açık ve net yazmanız işletme için çok önemlidir.

# wishTitleHint
source: The title of Wish & Suggestions is for you to understand briefly what the subject is.
tr: * Dilek & Şikayet başlığı kısaca konunun ne olduğunu anlatmanız içindir.

# wishPhoneHint
source: * The contact number is not a mandatory field. If you want the business to contact you, you can fill it out.
tr: * İletişim numarası doldurması zorunlu bir alan değildir. İşletmenin sizinle iletişime geçmesini istiyorsanız doldurabilirsiniz.

# wishSendComplete
source: Your Wish & Suggestions has been successfully submitted!
tr: Dilek & Şikayetiniz başarıyla iletilmiştir!

# wishSendError
source: An error was encountered while submitting your Wish & Suggestions! Please try again later.
tr: Dilek & Şikayetiniz iletilirken bir hata ile karşılaşıldı! Lütfen daha sonra tekrar deneyeniz.

# resSendComplete
source: Your booking request has been sent successfully!
tr: Rezervasyon talebiniz başarıyla iletilmiştir!

# resSendError
source: An error was encountered while submitting your booking request! Please try again later.
tr: Rezervasyon talebiniz iletilirken bir hata ile karşılaşıldı! Lütfen daha sonra tekrar deneyeniz.

# resCancelComplete
source: Your booking request has been successfully canceled!
tr: Rezervasyon talebiniz başarıyla iptal edilmiştir!

# resCancelError
source: An error was encountered while canceling your booking request! Please try again later.
tr: Rezervasyon talebiniz iptal edilirken bir hata ile karşılaşıldı! Lütfen daha sonra tekrar deneyeniz.

# cancelRes
source: Cancel Booking
tr: Rezervasyonu İptal Et

# customerUnknown
source: Customer code couldn't found!
tr: Müşteri kodu bulunamadı!

# campaignCodeDuplicateError
source: Sorry, you already have this campaign, you can't get the same campaign again without using your campaign at the business!
tr: Üzgünüz zaten bu kampanyaya sahipsiniz, kampanyanızı işletmede kullanmadan aynı kampanyayı tekrar alamazsınız!

# campaignCodeAddError
source: An error occurred while retrieving the promo code!
tr: Kampanya kodu alınırken bir hata meydana geldi!

# campaignCodeAddComplete
source: The campaign you selected has been successfully added to your campaigns!
tr: Seçtiğiniz kampanya, başarıyla kampanyalarınıza eklenmiştir!

# favoriteStoreNotFound
source: Sorry but you haven't got any business in your favorite list!
tr: Üzgünüz fakat favorilerinizde hiç işletme bulunmamaktadır!

# campaignUsageNotFound
source: Sorry but you haven't got any campaign code that you got!
tr: Üzgünüz fakat almış olduğunuz hiç kampanya kodunuz bulunamamktadır!

# campaignInfoNotFound
source: Campaing detail information not found!
tr: Kampanya detay bilgileri bulunamadı !

# reservationNotFound
source: Sorry but you haven't got any booking!
tr: Üzgünüz fakat hiç rezervasyonunuz bulunamamktadır!

# wishesNotFound
source: Sorry but you haven't got any wish or suggestion!
tr: Üzgünüz fakat hiç dilek veya şikayetiniz bulunamamktadır!

# menuItemNotFound
source: Sorry but there are no items on the business's menu!
tr: Üzgünüz fakat işletmenin menüsünde ürün bulunmamaktadır!

# campaignStoreNotFound
source: Sorry but the business currently has no campaigns running.
tr: Üzgünüz, şu anda işletmenin yayınlamış olduğu bir kampanya bulunmamaktadır!

# errorOccured
source: An error has occurred in the system!
tr: Sistemde bir hata meydana geldi!
